---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleCenterlinePattern
source: html/354748d9-e37e-6d39-004e-58605ebf0e78.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleCenterlinePattern Property

"Centerline Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleCenterlinePattern { get; }
```